In [1]:
import numpy as np
import pandas as pd

In [5]:
A=np.random.randint(1,10,(3,5))

In [3]:
a

array([0, 1, 2, 3, 4, 5, 6, 7])

In [20]:
df = pd.DataFrame({
    "a": [4, 5, 6], 
    "b": [7, 8, 9], 
    "c": [10, 11, 12]
}, index=['x','y','z'])

df

   a  b   c
x  4  7  10
y  5  8  11
z  6  9  12

In [27]:
rows_x_z = df.loc[['x', 'z']]
rows_x_z

   a  b   c
x  4  7  10
z  6  9  12

In [28]:
df.iloc[1]

a     5
b     8
c    11
Name: y, dtype: int64

In [29]:
subset = df.loc[['x', 'y'], ['a', 'c']]
print(subset)

   a   c
x  4  10
y  5  11

In [58]:
df=pd.read_csv('StockData (1).csv')

In [59]:
df.head()

  stock        date    price
0  AAPL  08-02-2013  67.8542
1  AAPL  11-02-2013  68.5614
2  AAPL  12-02-2013  66.8428
3  AAPL  13-02-2013  66.7156
4  AAPL  14-02-2013  66.6556

In [60]:
mini=df['price'].min()
maxi=df['price'].max()
mini, maxi

(np.float64(28.4), np.float64(179.26))

In [61]:
df.nunique()

stock       4
date     1259
price    3776
dtype: int64

In [62]:
def cal_profit(x):
    return x+x*.10

In [63]:
df['price'].apply(cal_profit)

0       74.63962
1       75.41754
2       73.52708
3       73.38716
4       73.32116
          ...
5031    85.60200
5032    84.45800
5033    81.21300
5034    80.59700
5035    81.24600
Name: price, Length: 5036, dtype: float64

In [64]:
df['profit']=df['price'].apply(cal_profit)

In [65]:
df

     stock        date    price    profit
0     AAPL  08-02-2013  67.8542  74.63962
1     AAPL  11-02-2013  68.5614  75.41754
2     AAPL  12-02-2013  66.8428  73.52708
3     AAPL  13-02-2013  66.7156  73.38716
4     AAPL  14-02-2013  66.6556  73.32116
...    ...         ...      ...       ...
5031   ZTS  01-02-2018  77.8200  85.60200
5032   ZTS  02-02-2018  76.7800  84.45800
5033   ZTS  05-02-2018  73.8300  81.21300
5034   ZTS  06-02-2018  73.2700  80.59700
5035   ZTS  07-02-2018  73.8600  81.24600

[5036 rows x 4 columns]

In [66]:
# Decending
df['profit'].sort_values(ascending=False)

1244    197.186
1243    197.010
1245    196.306
1241    194.799
1247    194.744
         ...
4076     31.460
4074     31.405
4075     31.383
4073     31.328
4072     31.240
Name: profit, Length: 5036, dtype: float64

In [67]:
def date_to_year(row):
    return int(row['date'].split('-')[2])

In [68]:
df['year']=df.apply(date_to_year, axis=1)

In [50]:
df

     stock        date     price     profit  year
0     AAPL  08-02-2013  74.63962  82.103582  2013
1     AAPL  11-02-2013  75.41754  82.959294  2013
2     AAPL  12-02-2013  73.52708  80.879788  2013
3     AAPL  13-02-2013  73.38716  80.725876  2013
4     AAPL  14-02-2013  73.32116  80.653276  2013
...    ...         ...       ...        ...   ...
5031   ZTS  01-02-2018  85.60200  94.162200  2018
5032   ZTS  02-02-2018  84.45800  92.903800  2018
5033   ZTS  05-02-2018  81.21300  89.334300  2018
5034   ZTS  06-02-2018  80.59700  88.656700  2018
5035   ZTS  07-02-2018  81.24600  89.370600  2018

[5036 rows x 5 columns]

In [69]:
df['date'] = pd.to_datetime(df['date'],dayfirst=True)

In [70]:
df.head()

  stock       date    price    profit  year
0  AAPL 2013-02-08  67.8542  74.63962  2013
1  AAPL 2013-02-11  68.5614  75.41754  2013
2  AAPL 2013-02-12  66.8428  73.52708  2013
3  AAPL 2013-02-13  66.7156  73.38716  2013
4  AAPL 2013-02-14  66.6556  73.32116  2013

In [71]:
df['new_year']=df['date'].dt.year

In [72]:
df

     stock       date    price    profit  year  new_year
0     AAPL 2013-02-08  67.8542  74.63962  2013      2013
1     AAPL 2013-02-11  68.5614  75.41754  2013      2013
2     AAPL 2013-02-12  66.8428  73.52708  2013      2013
3     AAPL 2013-02-13  66.7156  73.38716  2013      2013
4     AAPL 2013-02-14  66.6556  73.32116  2013      2013
...    ...        ...      ...       ...   ...       ...
5031   ZTS 2018-02-01  77.8200  85.60200  2018      2018
5032   ZTS 2018-02-02  76.7800  84.45800  2018      2018
5033   ZTS 2018-02-05  73.8300  81.21300  2018      2018
5034   ZTS 2018-02-06  73.2700  80.59700  2018      2018
5035   ZTS 2018-02-07  73.8600  81.24600  2018      2018

[5036 rows x 6 columns]

In [73]:
df.to_csv('stock.csv')